ERP.belugaerp/src/Enums/бг_ВариантыОтложеннойОбработкиОбъектов/бг_ВариантыОтложеннойОбработкиОбъектов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>бг_ВариантыОтложеннойОбработкиОбъектов</name>
  <enumValues>
    <name>АвтоСогласованиеЗаказовКлиентов</name>
  </enumValues>
  <enumValues>
    <name>АктуализироватьОбеспечениеЗаказовКлиентов</name>
  </enumValues>
  <enumValues>
    <name>ИзменитьДатуСвязанныхУчетныхДокументов</name>
  </enumValues>
  <enumValues>
    <name>ОбработатьАкцизныеМарки</name>
  </enumValues>
  <enumValues>
    <name>ОбработатьДокументыWMS</name>
  </enumValues>
  <enumValues>
    <name>ОбработатьНовуюОрганизациюЕГАИС</name>
  </enumValues>
  <enumValues>
    <name>ОбработатьПрисоединенныйФайлПисьма</name>
  </enumValues>
  <enumValues>
    <name>ОтправитьЗапросыСправки1ЕГАИС</name>
  </enumValues>
  <enumValues>
    <name>ОтразитьДополнительныеСведенияЗаказаКлиента</name>
  </enumValues>
  <enumValues>
    <name>ПередатьЗаказыКлиентовНаСборку</name>
  </enumValues>
  <enumValues>
    <name>ПерезаполнитьЗаявкиНаРасходованиеДС</name>
    <comment>Проект &quot;Магистраль&quot;</comment>
  </enumValues>
  <enumValues>
    <name>РассчитатьПоказателиРаботыОператоровWMS</name>
  </enumValues>
  <enumValues>
    <name>СоздатьИзменитьПодчиненнуюРеализацию</name>
  </enumValues>
  <enumValues>
    <name>СоздатьЗаказМагазина</name>
  </enumValues>
  <enumValues>
    <name>СоздатьНоменклатуруПартнера</name>
  </enumValues>
  <enumValues>
    <name>СформироватьДокументы</name>
  </enumValues>
  <enumValues>
    <name>СформироватьЗаказыКлиентов</name>
  </enumValues>
  <enumValues>
    <name>СформироватьИнтернетЗаказыКлиентов</name>
  </enumValues>
  <enumValues>
    <name>СформироватьРейсы</name>
  </enumValues>
  <enumValues>
    <name>СформироватьДвиженияМарок</name>
  </enumValues>
  <enumValues>
    <name>СформироватьОрдераНаОтражениеПересортицы</name>
  </enumValues>
  <enumValues>
    <name>АктуализироватьРезервыПриПоступленииТовара</name>
  </enumValues>
  <enumValues>
    <name>СформироватьПриходныйОрдерНаТовары</name>
  </enumValues>
  <enumValues>
    <name>СформироватьРасходныйОрдерНаТовары</name>
  </enumValues>
</mdclass:Enum>

ERP.belugaerp/src/Enums/бг_ВариантыОтложеннойОбработкиОбъектов/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Функция АктивныеВарианты() Экспорт

	АктивныеВарианты = Новый Массив;
	
	АктивныеВарианты.Добавить(АктивныйВариант("АвтоСогласованиеЗаказовКлиентов"));
	АктивныеВарианты.Добавить(АктивныйВариант("АктуализироватьОбеспечениеЗаказовКлиентов"));
    	АктивныеВарианты.Добавить(АктивныйВариант("АктуализироватьРезервыПриПоступленииТовара"));
	АктивныеВарианты.Добавить(АктивныйВариант("ИзменитьДатуСвязанныхУчетныхДокументов"));
	АктивныеВарианты.Добавить(АктивныйВариант("ОбработатьАкцизныеМарки"));
	АктивныеВарианты.Добавить(АктивныйВариант("ОбработатьДокументыWMS"));
	АктивныеВарианты.Добавить(АктивныйВариант("ОбработатьНовуюОрганизациюЕГАИС"));
	АктивныеВарианты.Добавить(АктивныйВариант("ОбработатьПрисоединенныйФайлПисьма"));
	АктивныеВарианты.Добавить(АктивныйВариант("ОтправитьЗапросыСправки1ЕГАИС"));
	АктивныеВарианты.Добавить(АктивныйВариант("ОтразитьДополнительныеСведенияЗаказаКлиента"));
	АктивныеВарианты.Добавить(АктивныйВариант("ПередатьЗаказыКлиентовНаСборку"));
	АктивныеВарианты.Добавить(АктивныйВариант("ПерезаполнитьЗаявкиНаРасходованиеДС"));
	АктивныеВарианты.Добавить(АктивныйВариант("РассчитатьПоказателиРаботыОператоровWMS"));
	АктивныеВарианты.Добавить(АктивныйВариант("СоздатьЗаказМагазина"));
	АктивныеВарианты.Добавить(АктивныйВариант("СоздатьИзменитьПодчиненнуюРеализацию"));
	АктивныеВарианты.Добавить(АктивныйВариант("СоздатьНоменклатуруПартнера"));
	АктивныеВарианты.Добавить(АктивныйВариант("СформироватьДвиженияМарок"));
	АктивныеВарианты.Добавить(АктивныйВариант("СформироватьДокументы"));
	АктивныеВарианты.Добавить(АктивныйВариант("СформироватьЗаказыКлиентов"));
	АктивныеВарианты.Добавить(АктивныйВариант("СформироватьИнтернетЗаказыКлиентов"));
	АктивныеВарианты.Добавить(АктивныйВариант("СформироватьОрдераНаОтражениеПересортицы"));
	АктивныеВарианты.Добавить(АктивныйВариант("СформироватьПриходныйОрдерНаТовары"));
	АктивныеВарианты.Добавить(АктивныйВариант("СформироватьРасходныйОрдерНаТовары"));
	АктивныеВарианты.Добавить(АктивныйВариант("СформироватьРейсы"));
	
	Возврат АктивныеВарианты;

КонецФункции

Функция АктивныйВариант(Имя) Экспорт
	
	ДанныеВарианта = Новый Структура;
	
	ДанныеВарианта.Вставить("Имя", Имя);
	ДанныеВарианта.Вставить("Значение", Перечисления.бг_ВариантыОтложеннойОбработкиОбъектов[Имя]);
	ДанныеВарианта.Вставить(
		"Представление",
		Метаданные.Перечисления.бг_ВариантыОтложеннойОбработкиОбъектов.ЗначенияПеречисления[Имя].Синоним);
	
	Возврат ДанныеВарианта;
	
КонецФункции

Функция ШапкаКлючаЗадания() Экспорт
	
	Возврат "бг_ОбработатьОбъектыДляОтложеннойОбработки";
	
КонецФункции

#КонецОбласти

#КонецЕсли
